app/views/admin/settings/edit.erb

SELECT `groups`.* FROM `groups`
---
    <label class="control-label"><%= t 'activerecord.attributes.setting.default_group' %></label>
    <div class="controls"><%= f.select :default_group, Group.all.collect{|g|[g.name, g.id]}, {:include_blank => true, :selected => Setting.default_group.to_i}  %></div>