app/controllers/comments_controller.rb

  def create
    return_with_text = Proc.new do |text|
      respond_to do |format|
        format.any(:html, :mobile) {
          if request.xhr?
            render :text => text
          else
            flash[:error] = text
            render :action => 'new'
          end
        }

        format.any(:js, :json){
          render :json => {:error => text}, :status => :unprocessable_entity
        }
      end
      return
    end

    if @article #when creating article's comments
      #    @article = Article.find params[:comment] unless @article
      group = @article.group
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1

      end

      comment.status = group.comments_need_approval? ? 'pending' : 'publish'
      @article.comments << comment
---
INSERT INTO `comments` (`anonymous`, `article_id`, `content`, `created_at`, `floor`, `link`, `name`, `neg`, `parent_id`, `pos`, `score`, `status`, `user_id`) VALUES (0, 1, '12', '2013-07-13 01:28:04', NULL, NULL, NULL, 0, NULL, 0, NULL, 'publish', 2)

  def find_article
    #find_group

    if params[:article_id]
      @article = Article.find(params[:article_id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1