app/controllers/lists_controller.rb

  def index
    @lists = List.all
---
SELECT `lists`.* FROM `lists`

  def show
    @list = List.find(params[:id])
    @articles = @list.articles.paginate :page => params[:page],:order => :pos
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
SELECT `articles`.* FROM `articles` INNER JOIN `list_items` ON `articles`.`id` = `list_items`.`article_id` WHERE `list_items`.`list_id` = 1 ORDER BY `articles`.`pos` LIMIT 20 OFFSET 0

  def edit
    @list = current_user.lists.find(params[:id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`user_id` = 2 AND `lists`.`id` = 1 LIMIT 1

  def create
    @list = current_user.lists.new(params[:list])

    respond_to do |format|
      if @list.save
---
INSERT INTO `lists` (`created_at`, `name`, `notes`, `private`, `updated_at`, `user_id`) VALUES ('2013-07-13 01:53:00', '23', '222', 1, '2013-07-13 01:53:00', 2)

  def append
    if @list.user != current_user
      return render :text=>'access denied', :status => :forbidden
    end
    @article = Article.find params[:article_id].gsub('#', '')

    if @article.status != 'publish'
      flash[:error] = '该文章无法公开'
    elsif @article.group.options[:encryption]
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1

  def find_list
    @list = List.find(params[:id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1